# Дано число обозначающее день недели. Вывести его название и
# указать является ли он выходным.

num = int(input('Введите номер дня недели: '))

def days(day):
    week = ['Подельник',
            'Вторник',
            'Среда',
            'Четверг',
            'Пятница',
            'Суббота',
            'Воскресение']
    if day < 1 or day > 7:
        print('')
    elif day >=6:
        print(f' {week[day - 1]}, выходной день')
    else:
        print(f' {week[day - 1]}, рабочий день')

days(num)